zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_hash.c
    /* Wait for BUSY flag to be set */
    if (HASH_WaitOnFlagUntilTimeout(hhash, HASH_FLAG_BUSY, RESET, HASH_TIMEOUTVALUE) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }

    /* Disable DMA channel */
    /* Note that the Abort function will
      - Clear the transfer error flags
      - Unlock
      - Set the State
    */
#ifdef HAL_DMA_MODULE_ENABLED
    if (hhash->hdmain != NULL)
    {
      if (HAL_DMA_Abort(hhash->hdmain) == HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* HAL_DMA_MODULE_ENABLED */
#ifdef HAL_MDMA_MODULE_ENABLED
    if (hhash->hmdmain != NULL)
    {
      if (HAL_MDMA_Abort(hhash->hmdmain) == HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* HAL_MDMA_MODULE_ENABLED */

    /* Clear DMAE bit */
    CLEAR_BIT(HASH->CR, HASH_CR_DMAE);

    /* Wait for BUSY flag to be reset */
    if (HASH_WaitOnFlagUntilTimeout(hhash, HASH_FLAG_BUSY, SET, HASH_TIMEOUTVALUE) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }

    if (__HAL_HASH_GET_FLAG(HASH_FLAG_DCIS) != 0U)
    {
      return HAL_ERROR;
    }

    /* At this point, DMA interface is disabled and no transfer is on-going */
    /* Retrieve from the DMA handle how many words remain to be written */
#ifdef HAL_DMA_MODULE_ENABLED
    if (hhash->hdmain != NULL)
    {
      tmp_remaining_DMATransferSize_inWords = ((DMA_Stream_TypeDef *)hhash->hdmain->Instance)->NDTR;
    }
#endif /* HAL_DMA_MODULE_ENABLED */
#ifdef HAL_MDMA_MODULE_ENABLED
    if (hhash->hmdmain != NULL)
    {
      tmp_remaining_DMATransferSize_inWords = (hhash->hmdmain->Instance->CBNDTR & MDMA_CBNDTR_BNDT);
    }
#endif /* HAL_MDMA_MODULE_ENABLED */


    if (tmp_remaining_DMATransferSize_inWords == 0U)
    {
      /* All the DMA transfer is actually done. Suspension occurred at the very end
         of the transfer. Either the digest computation is about to start (HASH case)
         or processing is about to move from one step to another (HMAC case).
         In both cases, the processing can't be suspended at this point. It is
         safer to
         - retrieve the low priority block digest before starting the high
           priority block processing (HASH case)
         - re-attempt a new suspension (HMAC case)
         */
      return HAL_ERROR;
    }
    else
    {
      /* Compute how many words were supposed to be transferred by DMA */
      tmp_initial_DMATransferSize_inWords = (((hhash->HashInCount % 4U) != 0U) ? \
                                             ((hhash->HashInCount + 3U) / 4U) : (hhash->HashInCount / 4U));

      /* If discrepancy between the number of words reported by DMA Peripheral and
        the numbers of words entered as reported by HASH Peripheral, correct it */
      /* tmp_words_already_pushed reflects the number of words that were already pushed before
         the start of DMA transfer (multi-buffer processing case) */
      tmp_words_already_pushed = hhash->NbWordsAlreadyPushed;
      if (((tmp_words_already_pushed + tmp_initial_DMATransferSize_inWords - \
            tmp_remaining_DMATransferSize_inWords) % 16U) != HASH_NBW_PUSHED())
      {
        tmp_remaining_DMATransferSize_inWords--; /* one less word to be transferred again */
      }

      /* Accordingly, update the input pointer that points at the next word to be
         transferred to the Peripheral by DMA */
      hhash->pHashInBuffPtr +=  4U * (tmp_initial_DMATransferSize_inWords - tmp_remaining_DMATransferSize_inWords) ;

      /* And store in HashInCount the remaining size to transfer (in bytes) */
      hhash->HashInCount = 4U * tmp_remaining_DMATransferSize_inWords;

    }

    /* Set State as suspended */
    hhash->State = HAL_HASH_STATE_SUSPENDED;

    return HAL_OK;

  }
}

/**
  * @brief  Return the HASH handle error code.
  * @param  hhash pointer to a HASH_HandleTypeDef structure.
  * @retval HASH Error Code
  */
uint32_t HAL_HASH_GetError(HASH_HandleTypeDef *hhash)
{
  /* Return HASH Error Code */
  return hhash->ErrorCode;
}
/**
  * @}
  */


/**
  * @}
  */

/** @defgroup HASH_Private_Functions HASH Private Functions
  * @{
  */


/**
  * @brief DMA HASH Input Data transfer completion callback.
  * @param hmdma DMA handle.
  * @note  In case of HMAC processing, HASH_DMAXferCplt() initiates
  *        the next DMA transfer for the following HMAC step.
  * @retval None
  */
#ifdef HAL_MDMA_MODULE_ENABLED
static void HASH_MDMAXferCplt2(MDMA_HandleTypeDef *hmdma)
{
  HASH_HandleTypeDef *hhash = (HASH_HandleTypeDef *)((MDMA_HandleTypeDef *)hmdma)->Parent;
  uint32_t datasentsize;
  uint32_t remainsize;
  HAL_StatusTypeDef status;

  if ((HASH->HWCFGR & 0xFFU) >= 1U)
  {
    CLEAR_BIT(HASH->CR, HASH_CR_DMAE);
    /* Next DMA is sent from the DMA handler, dma instance must be reset */
    if (READ_BIT(HASH->CR, HASH_CR_MODE) != 0U)
    {
      hmdma->State = HAL_MDMA_STATE_BUSY; /* to avoid error in MDMA_Abort */
      status = HAL_MDMA_Abort(hmdma);
      if (status != HAL_OK)
      {
        hhash->State = HAL_HASH_STATE_ERROR;
      }
    }
    SET_BIT(HASH->CR, HASH_CR_DMAA);
    datasentsize = (((hhash->HashInCount % 16U) != 0U) ? \
                    ((hhash->HashInCount / 16U) * 16U) : (hhash->HashInCount - 16U));
    remainsize = hhash->HashInCount - datasentsize;
    status = HASH_WriteData(hhash, (hhash->pHashInBuffPtr) + datasentsize, remainsize);
    if (status != HAL_OK)
    {
      hhash->Status = status;
    }
    if (READ_BIT(HASH->CR, HASH_CR_MDMAT) == 0U)
    {
      __HAL_HASH_START_DIGEST();
    }
    /* Wait for BUSY flag to be cleared */
    if (HASH_WaitOnFlagUntilTimeout(hhash, HASH_FLAG_BUSY, SET, HASH_TIMEOUTVALUE) != HAL_OK)
    {
      return ;
    }
  }
}

static void HASH_MDMAXferCplt(MDMA_HandleTypeDef *hmdma)
{
  HASH_HandleTypeDef *hhash = (HASH_HandleTypeDef *)((MDMA_HandleTypeDef *)hmdma)->Parent;
  uint32_t inputaddr = 0x0U;
  uint32_t buffersize = 0x0U;
  HAL_StatusTypeDef status = HAL_OK;

  if (hhash->State != HAL_HASH_STATE_SUSPENDED)
  {
    if (READ_BIT(HASH->CR, HASH_CR_MODE) == 0U)
    {
      if (READ_BIT(HASH->CR, HASH_CR_MDMAT) == 0U)
      {
        HASH_MDMAXferCplt2(hmdma);
      }
      /* Change the HASH state to ready */
      hhash->State = HAL_HASH_STATE_READY;

