zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_hash.c
        /* Set the phase to Step 1 */
        hhash->Phase = HAL_HASH_PHASE_HMAC_STEP_1;

      }
      else if (hhash->Phase == HAL_HASH_PHASE_HMAC_STEP_2)
      {
        /* Process a new input data message in case of multi-buffer HMAC processing
          (this is not a resumption case) */

        /* Change the HASH state */
        hhash->State = HAL_HASH_STATE_BUSY;

        /* Save input parameters to be able to manage possible suspension/resumption */
        hhash->HashInCount = Size;                /* Input message address       */
        hhash->pHashInBuffPtr = pInBuffer;        /* Input message size in bytes */

        /* Set DMA input parameters */
        inputaddr = (uint32_t)pInBuffer;           /* Input message address       */
        inputSize = Size;                          /* Input message size in bytes */

        if (hhash->DigestCalculationDisable == RESET)
        {
          /* This means this is the last buffer of the multi-buffer sequence: DCAL needs to be set. */
          __HAL_HASH_RESET_MDMAT();
          __HAL_HASH_SET_NBVALIDBITS(inputSize);
        }
      }
      else
      {
        /* Phase not aligned with handle READY state */
        __HAL_UNLOCK(hhash);
        /* Return function status */
        return HAL_ERROR;
      }
    }
    else
    {
      /* Resumption case (phase may be Step 1, 2 or 3) */

      /* Change the HASH state */
      hhash->State = HAL_HASH_STATE_BUSY;

      /* Set DMA input parameters at resumption location;
         inputaddr and inputSize are not set to the API input parameters
         but to those saved beforehand by HAL_HASH_DMAFeed_ProcessSuspend() when the
         processing was suspended. */
      inputaddr = (uint32_t)(hhash->pHashInBuffPtr);  /* Input message address       */
      inputSize = hhash->HashInCount;                 /* Input message size in bytes */
    }

#ifdef HAL_MDMA_MODULE_ENABLED
    if (hhash->hmdmain != NULL)
    {
      /* Set the HASH DMA transfer complete callback */
      hhash->hmdmain->XferCpltCallback = HASH_MDMAXferCplt;
      /* Set the DMA error callback */
      hhash->hmdmain->XferErrorCallback = HASH_MDMAError;
      /* Enable the DMA In DMA Stream */
      status = HAL_MDMA_Start_IT(hhash->hmdmain, inputaddr, (uint32_t)&HASH->DIN,
                                 (((inputSize % 16U) != 0U) ? ((inputSize) / 16U * 16U) : (inputSize - 16U)), 1U);
    }
#endif /* HAL_MDMA_MODULE_ENABLED */
#ifdef HAL_DMA_MODULE_ENABLED
    if (hhash->hdmain != NULL)
    {
      /* Set the HASH DMA transfer complete callback */
      hhash->hdmain->XferCpltCallback = HASH_DMAXferCplt;
      /* Set the DMA error callback */
      hhash->hdmain->XferErrorCallback = HASH_DMAError;


      /* Store number of words already pushed to manage proper
         DMA processing suspension */
      hhash->NbWordsAlreadyPushed = HASH_NBW_PUSHED();

      /* Enable the DMA In DMA Stream */
      status = HAL_DMA_Start_IT(hhash->hdmain, inputaddr, (uint32_t)&HASH->DIN,
                                (((inputSize % 4U) != 0U) ? ((inputSize + 3U) / 4U) : (inputSize / 4U)));
    }
#endif /* HAL_DMA_MODULE_ENABLED */

    /* Enable DMA requests */
    SET_BIT(HASH->CR, HASH_CR_DMAE);

    /* Process Unlocked */
    __HAL_UNLOCK(hhash);

    /* Return function status */
    if (status != HAL_OK)
    {
      /* Update HASH state machine to error */
      hhash->State = HAL_HASH_STATE_ERROR;
    }
    else
    {
      /* Change HASH state */
      hhash->State = HAL_HASH_STATE_READY;
    }
    /* Return function status */
    return status;
  }
  else
  {
    return HAL_BUSY;
  }
}


/**
  * @}
  */

#endif /* HAL_HASH_MODULE_ENABLED */

/**
  * @}
  */
#endif /*  HASH*/
/**
  * @}
  */
